using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace HackerRank.programs
{
    /// <summary>
    /// Программа вычисляет самое маленькое количество выложений в проект.
    /// Исходные данные:
    ///     У предпринимателя есть n число проектов, которые он выставил на бирже.
    ///     Каждый из разработчиков выставляет счёт за свои услуги по проекту. 
    ///     Найти минимальную стоимость за выполнение проекта.
    ///     Если проекта нет, то вернуть -1.
    /// Пример:
    ///     Число проектов: 3
    ///     Проекты: [2,1,0,2]
    ///     Ставки разработчиков: [7,8,4,9]
    ///     Вычисления: 7 + 8 + 4 = 19
    ///     Пояснение: За проект №2 ставки 7 и 9. Надо выбрать 7, потому что это дешевле, чем 9.
    /// </summary>
    class FreeLance
    {
        

    }
}
